{
    "Cora": "The Cora dataset is a citation graph where vertices represent papers and links represent citations between papers. Features are bag-of-words and labels are ground-truth topics. In summary, its statistics contain 2708 nodes,  5429 edges, 1433 features, 7 single classes, and accuracy as the evaluation metric.",
    "CiteSeer": "The Citeseer dataset is a citation graph where vertices represent papers and links represent citations between papers. Features are bag-of-words and labels are ground-truth topics. In summary, its statistics contain 3327 nodes,  4732 edges, 3703 features, 6 single classes, and accuracy as the evaluation metric. ",
    "PubMed": "The Pubmed dataset is a citation graph where vertices represent papers and links represent citations between papers. Features are bag-of-words and labels are ground-truth topics. In summary, its statistics contain 19717 nodes,  44338 edges, 500 features, 3 single classes, and accuracy as the evaluation metric.",
    "Coauthor-CS": "The Coauthor CS dataset is a co-authorship graph from Microsoft Academic Graph. Vertices represent authors, links represent co-author relationships, features represent the authors' paper keywords, and vertices labels indicate the author's research fields. In summary, its statistics contain 18333 nodes,  81894 edges, 6805 features, 15 single classes, and accuracy as the evaluation metric. ",
    "Coauthor-Physics": "The Coauthor Physics dataset is a co-authorship graph from Microsoft Academic Graph. Vertices represent authors, links represent co-author relationships, features represent the authors' paper keywords, and vertices labels indicate the author's research fields. In summary, its statistics contain 34493 nodes,  247962 edges, 8415 features, 5 single classes, and accuracy as the evaluation metric.",
    "Amazon-Photo": "The Amazon Photo dataset is a subset of Amazon's co-purchase graph. Vertices represent products, and links between products represent that they are frequently bought together, features are bag-of-words of product reviews, and vertices labels are the product category. In summary, its statistics contain 7487 nodes,  119043 edges, 745 features, 8 single classes, and accuracy as the evaluation metric.",
    "Amazon-Computer": "The Amazon Computers dataset is a subset of Amazon's co-purchase graph. Vertices represent products, and links between products represent that they are frequently bought together, features are bag-of-words of product reviews, and vertices labels are the product category. In summary, its statistics contain 13381 nodes,  245778 edges, 767 features, 10 single classes, and accuracy as the evaluation metric.",
    "ogbn-arXiv": "The ogbn-arXiv dataset, a part of the Open Graph Benchmark, is a graph representing the citation relationships between papers from the arXiv Computer Science (CS) category indexed by MAG. Each paper has a feature vector based on word embedding in its title and abstract. Labels indicate the subject areas of papers, and the dataset is split based on chronological order. In summary, its statistics contain 169343 nodes,  1166243 edges, 128 features, 40 single classes, and accuracy as the evaluation metric.",
    "ogbn-proteins": "The ogbn-proteins dataset, a part of the Open Graph Benchmark, is a protein association graph, where vertices represent proteins and links represent different types of biological associations between proteins. The task is to predict the protein functions in a multi-label binary classification setup with data split based on the different species the proteins come from. In summary, its statistics contain 132534 nodes, 39561252 edges, 8 features, 112 single classes, and ROC-AUC as the evaluation metric."
}
